
### ❌ Terraform Plan for dev has Failed
      
```hcl
Terraform plan failed with the following error:    
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # helm_release.argo_cd will be created
  + resource "helm_release" "argo_cd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo-cd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                server:
                  service:
                    type: ClusterIP
            EOT,
        ]
      + verify                     = false
      + version                    = "8.3.9"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:167175811320:access-entry/questcode-cluster/user/167175811320/Devops/c8cca90a-d057-4655-5d68-2387e1215d18" -> (known after apply)
      ~ created_at        = "2025-09-16T10:32:53Z" -> (known after apply)
      ~ id                = "questcode-cluster:arn:aws:iam::167175811320:user/Devops" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-09-16T10:32:53Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::167175811320:user/Devops" -> "arn:aws:iam::167175811320:role/github_access" # forces replacement
        tags              = {
            "Environment" = "prod"
            "Terraform"   = "true"
        }
      ~ user_name         = "arn:aws:iam::167175811320:user/Devops" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-09-16 10:32:54.495 +0000 UTC" -> (known after apply)
      ~ id            = "questcode-cluster#arn:aws:iam::167175811320:user/Devops#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-09-16 10:32:54.495 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::167175811320:user/Devops" -> "arn:aws:iam::167175811320:role/github_access" # forces replacement
        # (3 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.karpenter.aws_iam_policy.controller[0] will be updated in-place
  ~ resource "aws_iam_policy" "controller" {
        id               = "arn:aws:iam::167175811320:policy/KarpenterController-20250916103326622000000011"
        name             = "KarpenterController-20250916103326622000000011"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (5 unchanged elements hidden)
                    {
                        Action    = [
                            "ec2:TerminateInstances",
                            "ec2:DeleteLaunchTemplate",
                        ]
                        Condition = {
                            StringEquals = {
                                "aws:ResourceTag/kubernetes.io/cluster/questcode-cluster" = "owned"
                            }
                            StringLike   = {
                                "aws:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:ec2:us-east-1:*:launch-template/*",
                            "arn:aws:ec2:us-east-1:*:instance/*",
                        ]
                        Sid       = "AllowScopedDeletion"
                    },
                  ~ {
                      ~ Action    = [
                            # (7 unchanged elements hidden)
                            "ec2:DescribeImages",
                          + "ec2:DescribeCapacityReservations",
                            "ec2:DescribeAvailabilityZones",
                        ]
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action   = "ssm:GetParameter"
                        Effect   = "Allow"
                        Resource = "arn:aws:ssm:us-east-1::parameter/aws/service/*"
                        Sid      = "AllowSSMReadActions"
                    },
                    # (9 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "Environment" = "prod"
            "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.karpenter.aws_iam_role.controller[0] will be updated in-place
  ~ resource "aws_iam_role" "controller" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRoleWithWebIdentity" -> [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/7CF9BC753AEE4205D6F5F6EE87E9D453:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      ~ Principal = {
                          - Federated = "arn:aws:iam::167175811320:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7CF9BC753AEE4205D6F5F6EE87E9D453"
                          + Service   = "pods.eks.amazonaws.com"
                        }
                      ~ Sid       = "KarpenterControllerTrust" -> "PodIdentity"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "KarpenterController-20250916102205376400000002"
        name                  = "KarpenterController-20250916102205376400000002"
        tags                  = {
            "Environment" = "prod"
            "Terraform"   = "true"
        }
        # (11 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "d017cc23-d6f7-4909-b2e3-cc51552ad4b9"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::167175811320:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::167175811320:user/Devops" -> "arn:aws:iam::167175811320:role/github_access"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::167175811320:role/questcode-cluster-cluster-20250916102205375600000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "prod"
            "Terraform"             = "true"
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.

Error: Plugin error

  with kubernetes_manifest.argocd_root_app,
  on main.tf line 144, in resource "kubernetes_manifest" "argocd_root_app":
 144: resource "kubernetes_manifest" "argocd_root_app" {

The plugin returned an unexpected error from
plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc =
failed to determine resource type ID: failed to look up GVK
[argoproj.io/v1alpha1, Kind=Application] among available CRDs:
customresourcedefinitions.apiextensions.k8s.io is forbidden: User
"arn:aws:sts::167175811320:assumed-role/github_access/GitHubActionsSession"
cannot list resource "customresourcedefinitions" in API group
"apiextensions.k8s.io" at the cluster scope
::error::Terraform exited with code 1.
```

<sub>This PR was opened by <code>Alialshemy</code> and triggered by the <code>pull_request</code> event.</sub>
